trade_exp/src/InformationRegisters/АналитикаУчетаНоменклатуры/АналитикаУчетаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3f1474f8-aa38-42d7-b209-c80ad3db4af3">
  <name>АналитикаУчетаНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="1c90c910-56a7-42a1-8d15-4b96ce66a164">
    <name>КлючАналитики</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="2faf9d15-792d-47af-a0c3-eefd90bdfd81">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="14ae852a-8db3-44b4-baa2-bb9989fd5c10">
    <name>МестоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b016d84c-f5ee-47fa-8f8b-2db70fd2d576">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/РеестрДокументов/РеестрДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="44851db7-ace4-11e7-7088-f45c898df8f7">
  <name>РеестрДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="448617a8-ace4-11e7-7088-f45c898df8f7">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44862216-ace4-11e7-7088-f45c898df8f7">
    <name>ПометкаУдаления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44862720-ace4-11e7-7088-f45c898df8f7">
    <name>ДатаПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="4485debe-ace4-11e7-7088-f45c898df8f7">
    <name>НомерДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44862c2a-ace4-11e7-7088-f45c898df8f7">
    <name>НомерПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44860178-ace4-11e7-7088-f45c898df8f7">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44861d0c-ace4-11e7-7088-f45c898df8f7">
    <name>Проведен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863b70-ace4-11e7-7088-f45c898df8f7">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863652-ace4-11e7-7088-f45c898df8f7">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="448607f4-ace4-11e7-7088-f45c898df8f7">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863134-ace4-11e7-7088-f45c898df8f7">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44861276-ace4-11e7-7088-f45c898df8f7">
    <name>Дополнительно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44860d4e-ace4-11e7-7088-f45c898df8f7">
    <name>ДополнительнаяЗапись</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c033ddc4-ace7-11e7-7088-f45c898df8f7">
    <name>ДатаОтраженияВУчете</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="831ffe7e-f3df-4095-a10b-b5fb3a077003">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="9db0faa0-6639-4188-b1ae-45947ea159fa">
    <name>СторноИсправление</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="f67589b3-bd43-48f7-a0f9-db01f3da814e">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="448640c0-ace4-11e7-7088-f45c898df8f7">
    <name>ТипСсылки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44864796-ace4-11e7-7088-f45c898df8f7">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44867356-ace4-11e7-7088-f45c898df8f7">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44866bd6-ace4-11e7-7088-f45c898df8f7">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="448698e0-ace4-11e7-7088-f45c898df8f7">
    <name>Ссылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="448679be-ace4-11e7-7088-f45c898df8f7">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="448692aa-ace4-11e7-7088-f45c898df8f7">
    <name>ДатаДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44868666-ace4-11e7-7088-f45c898df8f7">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44868c92-ace4-11e7-7088-f45c898df8f7">
    <name>МестоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/ОтчетОРозничныхПродажах/ОтчетОРозничныхПродажах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ОтчетОРозничныхПродажах</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПоРезультатамИнвентаризации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокФакт</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокУчет</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Помещение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Продавец</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОплатаБонуснымиБаллами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>БонуснаяПрограммаЛояльности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОплаты</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБаллов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачислениеБонусныхБаллов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СуммаБонусныхБаллов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>БонуснаяПрограммаЛояльности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаСписания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНачисления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодарочныеСертификаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ПодарочныйСертификат</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаВВалютеСертификата</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОплатаПлатежнымиКартами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ЭквайринговыйТерминал</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодАвторизации</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>6</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерПлатежнойКарты</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>22</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/CommonModules/ЗапасыСервер/Module.bsl
&ИзменениеИКонтроль("ТаблицаОстатковРеализованныхТоваров")
Процедура Док_ТаблицаОстатковРеализованныхТоваров(ДокументОбъект, МенеджерВременныхТаблиц, ПараметрыЗаполненияВидовЗапасов)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.ДокументРеализации КАК ДокументРеализации,
	|	ТаблицаТоваров.СпособОпределенияСебестоимости КАК СпособОпределенияСебестоимости,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры) КАК АналитикаУчетаНоменклатуры,
	|	&ТекстПоляТаблицаТоваровНоменклатураПартнера_ КАК НоменклатураПартнера	
	|ПОМЕСТИТЬ СгруппированнаяТаблицаТоваров
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.ДокументРеализации КАК Ссылка,
	|	КлючиАналитикиУчетаНоменклатуры.КлючАналитики КАК АналитикаУчетаНоменклатуры
	|ПОМЕСТИТЬ ТаблицаТоваровСКлючамиПоВсемСкладам
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|		ПО ТаблицаТоваров.Номенклатура = КлючиАналитикиУчетаНоменклатуры.Номенклатура
	|			И ТаблицаТоваров.Характеристика = КлючиАналитикиУчетаНоменклатуры.Характеристика
	|			И (&ЭтоВозврат
	|				ИЛИ (НЕ &ЭтоВозврат
	|					И ТаблицаТоваров.Серия = КлючиАналитикиУчетаНоменклатуры.Серия))
	|ГДЕ
	|	ТаблицаТоваров.СпособОпределенияСебестоимости = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	АналитикаУчетаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыОтгрузки,
	|	ТЧВидыЗапасов.Ссылка КАК ДокументРеализации,
	|	ТЧВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД КАК НомерГТД,
	|	ТЧВидыЗапасов.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС
	|ПОМЕСТИТЬ РеализованныеТовары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка.Проведен
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.Ссылка, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.Ссылка,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	ТЧВидыЗапасов.Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	0 КАК СуммаНДС
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	(ТЧВидыЗапасов.Ссылка, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И ТаблицаДанныхДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки,
	|	ТЧВидыЗапасов.ДокументРеализации,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	-ТЧВидыЗапасов.Количество,
	|	0 КАК КоличествоПоРНПТ,
	|	0 КАК СуммаНДС
	|ИЗ
	|	Документ.ОтчетОРозничныхВозвратах.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И (ТЧВидыЗапасов.ДокументРеализации, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И ТаблицаДанныхДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.Ссылка.ДокументОснование,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ТЧВидыЗапасов.КорВидЗапасов КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	ВЫБОР
	|		КОГДА НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|				ИЛИ &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|				ИЛИ &ЭтоКорректировкаРеализации
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|							ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|						ТОГДА 0
	|					ИНАЧЕ ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|				КОНЕЦ
	|			ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовСписание КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.Ссылка.ДокументОснование, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.Ссылка.ДокументОснование,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ТЧВидыЗапасов.КорВидЗапасов КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	ВЫБОР
	|		КОГДА НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|				ИЛИ &ЭтоКорректировкаРеализации
	|			ТОГДА -ТЧВидыЗапасов.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|				ИЛИ &ЭтоКорректировкаРеализации
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|							ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|						ТОГДА 0
	|					ИНАЧЕ -ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|				КОНЕЦ
	|			ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА -ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовОприходование КАК ТЧВидыЗапасов
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.Ссылка.ДокументОснование, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.Ссылка.ДокументОснование,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовКорректировкаВыручки КАК ТЧВидыЗапасов
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.Ссылка.ДокументОснование, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки,
	|	ТЧВидыЗапасов.ДокументРеализации,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	-ТЧВидыЗапасов.Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ -ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	0 КАК СуммаНДС
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.ДокументРеализации, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыОтгрузки,
	|	ТЧВидыЗапасов.Ссылка КАК ДокументРеализации,
	|	ТЧВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД КАК НомерГТД,
	|	ТЧВидыЗапасов.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС
	|ИЗ
	|	Документ.АктВыполненныхРабот.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка.Проведен
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.Ссылка, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатурыОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.ДокументРеализации					КАК ДокументРеализации,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатурыОтгрузки	КАК АналитикаУчетаНоменклатурыОтгрузки,
	|	КлючиАналитики.Номенклатура							КАК Номенклатура,
	|	КлючиАналитики.Характеристика						КАК Характеристика,
	|	КлючиАналитики.Назначение							КАК Назначение,
	|	КлючиАналитики.Серия								КАК Серия,
	|	КлючиАналитики.МестоХранения						КАК МестоХранения,
	|	ТаблицаТоваров.ВидЗапасов							КАК ВидЗапасов,
	|	ТаблицаТоваров.КорВидЗапасов						КАК КорВидЗапасов,
	|	ТаблицаТоваров.НомерГТД								КАК НомерГТД,
	|	СУММА(ТаблицаТоваров.Количество)					КАК Количество,
	|	СУММА(ТаблицаТоваров.КоличествоПоРНПТ)				КАК КоличествоПоРНПТ,
	|	СУММА(ТаблицаТоваров.СуммаНДС)						КАК СуммаНДС
	|ПОМЕСТИТЬ РеализованныеТоварыСгруппированная
	|ИЗ
	|	РеализованныеТовары КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|		ПО ТаблицаТоваров.АналитикаУчетаНоменклатурыОтгрузки = КлючиАналитики.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.ДокументРеализации,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатурыОтгрузки,
	|	КлючиАналитики.Номенклатура,
	|	КлючиАналитики.Характеристика,
	|	КлючиАналитики.Назначение,
	|	КлючиАналитики.Серия,
	|	КлючиАналитики.МестоХранения,
	|	ТаблицаТоваров.ВидЗапасов,
	|	ТаблицаТоваров.КорВидЗапасов,
	|	ТаблицаТоваров.НомерГТД
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаТоваров.Количество) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.ДокументРеализации				КАК ДокументРеализации,
	|	ТаблицаТоваров.СпособОпределенияСебестоимости	КАК СпособОпределенияСебестоимости,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
	|	КлючиАналитики.Номенклатура						КАК Номенклатура,
	|	КлючиАналитики.Характеристика					КАК Характеристика,
	|	КлючиАналитики.Назначение						КАК Назначение,
	|	КлючиАналитики.Серия							КАК Серия,
	|	КлючиАналитики.МестоХранения					КАК МестоХранения,
	|	РеализованныеТовары.Серия						КАК СерияДляСоединения,
	|	ТаблицаТоваров.НоменклатураПартнера				КАК НоменклатураПартнера
	|ПОМЕСТИТЬ ТаблицаТоваровДляСоединения
	|ИЗ
	|	СгруппированнаяТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|		ПО ТаблицаТоваров.АналитикаУчетаНоменклатуры = КлючиАналитики.Ссылка
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеализованныеТоварыСгруппированная КАК РеализованныеТовары
	|		ПО КлючиАналитики.Номенклатура = РеализованныеТовары.Номенклатура
	|			И КлючиАналитики.Характеристика = РеализованныеТовары.Характеристика
	|			И (КлючиАналитики.Серия = РеализованныеТовары.Серия
	|				ИЛИ КлючиАналитики.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	|ГДЕ
	|	&ЭтоВозврат
	|	И НЕ РеализованныеТовары.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.ДокументРеализации				КАК ДокументРеализации,
	|	ТаблицаТоваров.СпособОпределенияСебестоимости	КАК СпособОпределенияСебестоимости,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
	|	КлючиАналитики.Номенклатура						КАК Номенклатура,
	|	КлючиАналитики.Характеристика					КАК Характеристика,
	|	КлючиАналитики.Назначение						КАК Назначение,
	|	КлючиАналитики.Серия							КАК Серия,
	|	КлючиАналитики.МестоХранения					КАК МестоХранения,
	|	РеализованныеТовары.Серия						КАК СерияДляСоединения,
	|	ТаблицаТоваров.НоменклатураПартнера				КАК НоменклатураПартнера
	|ИЗ
	|	СгруппированнаяТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|		ПО ТаблицаТоваров.АналитикаУчетаНоменклатуры = КлючиАналитики.Ссылка
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеализованныеТоварыСгруппированная КАК РеализованныеТовары
	|		ПО КлючиАналитики.Номенклатура = РеализованныеТовары.Номенклатура
	|			И КлючиАналитики.Характеристика = РеализованныеТовары.Характеристика
	|			И (КлючиАналитики.Серия = РеализованныеТовары.Серия
	|				ИЛИ НЕ КлючиАналитики.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	|ГДЕ
	|	&ЭтоВозврат
	|	И РеализованныеТовары.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.ДокументРеализации				КАК ДокументРеализации,
	|	ТаблицаТоваров.СпособОпределенияСебестоимости	КАК СпособОпределенияСебестоимости,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
	|	КлючиАналитики.Номенклатура						КАК Номенклатура,
	|	КлючиАналитики.Характеристика					КАК Характеристика,
	|	КлючиАналитики.Назначение						КАК Назначение,
	|	КлючиАналитики.Серия							КАК Серия,
	|	КлючиАналитики.МестоХранения					КАК МестоХранения,
	|	КлючиАналитики.Серия							КАК СерияДляСоединения,
	|	ТаблицаТоваров.НоменклатураПартнера				КАК НоменклатураПартнера
	|ИЗ
	|	СгруппированнаяТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|		ПО ТаблицаТоваров.АналитикаУчетаНоменклатуры = КлючиАналитики.Ссылка
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеализованныеТоварыСгруппированная КАК РеализованныеТовары
	|		ПО КлючиАналитики.Номенклатура = РеализованныеТовары.Номенклатура
	|			И КлючиАналитики.Характеристика = РеализованныеТовары.Характеристика
	|			И КлючиАналитики.Серия = РеализованныеТовары.Серия
	|ГДЕ
	|	НЕ &ЭтоВозврат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанныхДокумента.Организация КАК Организация,
	|	ТаблицаДанныхДокумента.Склад КАК Склад,
	|	СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	РеализованныеТовары.Номенклатура КАК Номенклатура,
	|	РеализованныеТовары.Характеристика КАК Характеристика,
	|	РеализованныеТовары.Серия КАК Серия,
	|	РеализованныеТовары.МестоХранения КАК СкладОтгрузки,
	|	РеализованныеТовары.Назначение КАК Назначение,
	|	РеализованныеТовары.ДокументРеализации КАК ДокументРеализации,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОприходования,
	|	СгруппированнаяТаблицаТоваров.НоменклатураПартнера КАК НоменклатураПартнера,
	|	ВЫБОР
	|		КОГДА РеализованныеТовары.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РеализованныеТовары.ВидЗапасов
	|	КОНЕЦ КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА РеализованныеТовары.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА РеализованныеТовары.ВидЗапасов.ВидЗапасовВладельца
	|		ИНАЧЕ РеализованныеТовары.ВидЗапасов
	|	КОНЕЦ КАК ВидЗапасовВладельца,
	|	РеализованныеТовары.ВидЗапасов КАК ВидЗапасовОтгрузки,
	|	РеализованныеТовары.КорВидЗапасов КАК КорВидЗапасов,
	|	РеализованныеТовары.НомерГТД КАК НомерГТД,
	|	ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка) КАК Сделка,
	|	НЕОПРЕДЕЛЕНО КАК ВидЗапасовПолучателя,
	|	НЕОПРЕДЕЛЕНО КАК ДатаПоступления,
	|	СУММА(РеализованныеТовары.Количество) КАК КоличествоОстаток,
	|	СУММА(ВЫРАЗИТЬ(РеализованныеТовары.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))) КАК КоличествоПоРНПТОстаток,
	|	0 КАК СуммаОстаток,
	|	СУММА(РеализованныеТовары.СуммаНДС) КАК СуммаНДСОстаток
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	РеализованныеТоварыСгруппированная КАК РеализованныеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоваровДляСоединения КАК СгруппированнаяТаблицаТоваров
	|		ПО РеализованныеТовары.Номенклатура = СгруппированнаяТаблицаТоваров.Номенклатура
	|			И РеализованныеТовары.Характеристика = СгруппированнаяТаблицаТоваров.Характеристика
	|			И РеализованныеТовары.Серия = СгруппированнаяТаблицаТоваров.СерияДляСоединения
	|			И ВЫБОР
	|				КОГДА &ЭтоКорректировкаРеализации
	|					ТОГДА РеализованныеТовары.МестоХранения = СгруппированнаяТаблицаТоваров.МестоХранения
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|			И РеализованныеТовары.ДокументРеализации = СгруппированнаяТаблицаТоваров.ДокументРеализации
	|			И (
	|				(&ЭтоКорректировкаРеализации
	|					И РеализованныеТовары.Назначение = СгруппированнаяТаблицаТоваров.Назначение)
	|				ИЛИ
	|				(НЕ &ЭтоКорректировкаРеализации
	|					И (РеализованныеТовары.Назначение = СгруппированнаяТаблицаТоваров.Назначение
	|						ИЛИ СгруппированнаяТаблицаТоваров.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|						ИЛИ РеализованныеТовары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)))
	|				)
	|			И (СгруппированнаяТаблицаТоваров.СпособОпределенияСебестоимости = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДанныхДокумента.Склад,
	|	РеализованныеТовары.Номенклатура,
	|	РеализованныеТовары.Серия,
	|	СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры,
	|	РеализованныеТовары.Назначение,
	|	РеализованныеТовары.МестоХранения,
	|	РеализованныеТовары.НомерГТД,
	|	ТаблицаДанныхДокумента.Организация,
	|	РеализованныеТовары.ДокументРеализации,
	|	СгруппированнаяТаблицаТоваров.НоменклатураПартнера,
	|	РеализованныеТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА РеализованныеТовары.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РеализованныеТовары.ВидЗапасов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РеализованныеТовары.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА РеализованныеТовары.ВидЗапасов.ВидЗапасовВладельца
	|		ИНАЧЕ РеализованныеТовары.ВидЗапасов
	|	КОНЕЦ,
	|	РеализованныеТовары.ВидЗапасов,
	|	РеализованныеТовары.КорВидЗапасов
	|
	|ИМЕЮЩИЕ
	|	СУММА(РеализованныеТовары.Количество) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДанныхДокумента.Организация,
	|	ТаблицаДанныхДокумента.Склад,
	|	СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.Номенклатура,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.Характеристика,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.Серия,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.МестоХранения,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.Назначение,
	|	ТаблицаВидыЗапасов.ДокументРеализации,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОприходования,
	|	СгруппированнаяТаблицаТоваров.НоменклатураПартнера,
	|	ТаблицаВидыЗапасов.ВидЗапасов,
	|	ТаблицаВидыЗапасов.ВидЗапасов,
	|	ТаблицаВидыЗапасов.ВидЗапасов,
	|	ТаблицаВидыЗапасов.КорВидЗапасов,
	|	ТаблицаВидыЗапасов.НомерГТД,
	|	ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаВидыЗапасов.Количество,
	|	ВЫРАЗИТЬ(ТаблицаВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11)),
	|	0,
	|	ТаблицаВидыЗапасов.СуммаНДС
	|ИЗ
	|	СгруппированнаяТаблицаТоваров КАК СгруппированнаяТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаВидыЗапасов КАК ТаблицаВидыЗапасов
	|		ПО СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры = ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры
	|			И СгруппированнаяТаблицаТоваров.СпособОпределенияСебестоимости <> ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи)
	|			И ТаблицаВидыЗапасов.СпособОпределенияСебестоимости <> ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РеализованныеТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СгруппированнаяТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаТоваровСКлючамиПоВсемСкладам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РеализованныеТоварыСгруппированная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаТоваровДляСоединения";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("ЭтоВозврат",
								ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ВозвратТоваровОтКлиента"));
	Запрос.УстановитьПараметр("ЭтоКорректировкаРеализации",
								ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.КорректировкаРеализации"));
	
	УчетПрослеживаемыхТоваровЛокализация.УстановитьПараметрыИспользованияУчетаПрослеживаемыхТоваров(Запрос);
	
	ОбщегоНазначенияУТ.ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
																Запрос.Текст,
																"&ТекстПоляТаблицаТоваровНоменклатураПартнера_",
																"ТаблицаТоваров",
																"НоменклатураПартнера",
																"ТаблицаТоваров.НоменклатураПартнера",
																"ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)");
	
	#Вставка															
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ВозвратТоваровОтКлиента") Тогда
		Если ТипЗнч(ДокументОбъект.ЧекККМ)=Тип("ДокументСсылка.ЧекККМ") Тогда
			СкладОтгрузкиРозницы=ДокументОбъект.ЧекККМ.Склад;
			Запрос.УстановитьПараметр("СкладОтгрузкиРозницы", СкладОтгрузкиРозницы);
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"	И ТаблицаДанныхДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя)",
			"	И ТаблицаДанныхДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя) 
			| и ТЧВидыЗапасов.АналитикаУчетаНоменклатуры.МестоХранения=&СкладОтгрузкиРозницы ");
		КонецЕсли;	
	Конецесли;
	#КонецВставки															
	Запрос.Выполнить();
КонецПроцедуры
